In [1]:
import numpy as np
import pandas as pd

In [2]:
zzz = pd.Series(range (3), index= ['a', 'b', 'c'])

In [3]:
index = zzz.index

In [9]:
labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [10]:
zzz2 = pd.Series([1.5, -2.5, 0], index=labels)
zzz2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [11]:
zzz2.index is labels

True

### Creating a new index

In [13]:
zzz = pd.Series([4.5, 7.2, -5.3, 3.6], index = ['d', 'b', 'a', 'c'])
zzz

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [14]:
zzz2 = zzz.reindex(['a','b', 'c', 'd', 'e'])
zzz2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [25]:
reptiles = pd.Series(['crocodile', 'snake', 'lizard'], index =[0,1,2])
reptiles

0    crocodile
1        snake
2       lizard
dtype: object

In [26]:
reptiles = pd.DataFrame(np.arange(9).reshape((3, 3)),index=['a', 'c', 'd'],columns=['Snake', 'Lizard', 'Crocodile'])

In [27]:
reptiles

   Snake  Lizard  Crocodile
a      0       1          2
c      3       4          5
d      6       7          8

In [29]:
reptiles2 = ['Cobra','Chameleon','Alligator']
reptiles.reindex(columns=reptiles2)

   Cobra  Chameleon  Alligator
a    NaN        NaN        NaN
c    NaN        NaN        NaN
d    NaN        NaN        NaN

### Droping Entries from an Axis

In [30]:
zzz = pd.Series(np.arange(5.), index= ['a', 'b','c','d','e'])
zzz

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [32]:
new_zzz = zzz.drop('a')
new_zzz

b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [34]:
reptiles = pd.DataFrame(np.arange(9).reshape((3, 3)),index=['a', 'c', 'd'],columns=['Snake', 'Lizard', 'Crocodile'])
reptiles

   Snake  Lizard  Crocodile
a      0       1          2
c      3       4          5
d      6       7          8

In [40]:
zzz_reptiles = reptiles.drop(['d'])
zzz_reptiles
#Drop Rows

   Snake  Lizard  Crocodile
a      0       1          2
c      3       4          5

In [43]:
zzz_reptiles = reptiles.drop('Crocodile', axis=1)
zzz_reptiles
#Drop Columns // or axis= columns
'''inplace=True destroy data'''

   Snake  Lizard
a      0       1
c      3       4
d      6       7